
## Plan Result




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_api_operation_policy.apim_api_operation_policy[&#34;sendOtpEmail&#34;]
  * module.apim_api[0].azurerm_api_management_api.api
  * module.apim_api[0].azurerm_api_management_product_api.link_to_product[0]
  * module.apim_api_policy[0].azurerm_api_management_api_policy.api_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_operation_policy.apim_api_operation_policy["sendOtpEmail"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pip-publication-services-api"
      + id                  = (known after apply)
      + operation_id        = "sendOtpEmail"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
              </inbound>
              <backend>
                <base />
              </backend>
              <outbound>
                <base />
              </outbound>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.apim_api[0].azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "sds-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "pip-publication-services-api"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "pip-publication-services-api"
      + path                  = "pip/publication-services"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "ss-stg-network-rg"
      + revision              = "1"
      + service_url           = "https://pip-publication-services.staging.platform.hmcts.net"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json"
          + content_value  = jsonencode(
                {
                  + components   = {
                      + schemas = {
                          + OtpEmail = {
                              + properties = {
                                  + bearer = {
                                      + type = "string"
                                    }
                                  + email  = {
                                      + type = "string"
                                    }
                                  + otp    = {
                                      + type = "string"
                                    }
                                }
                              + type       = "object"
                            }
                        }
                    }
                  + externalDocs = {
                      + description = "README"
                      + url         = "https://github.com/hmcts/pip-publication-services"
                    }
                  + info         = {
                      + description = "Use this service to send emails with Gov.UK Notify and send publications to third party systems"
                      + license     = {
                          + name = "MIT"
                          + url  = "https://opensource.org/licenses/MIT"
                        }
                      + title       = "CaTH Publication Services Service"
                      + version     = "1.0.0"
                    }
                  + openapi      = "3.0.1"
                  + paths        = {
                      + "/"           = {
                          + get = {
                              + operationId = "welcome"
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "OK"
                                    }
                                }
                              + summary     = "Get Welcome"
                              + tags        = [
                                  + "Publication Services root API",
                                ]
                            }
                        }
                      + "/notify/otp" = {
                          + post = {
                              + operationId = "sendOtpEmail"
                              + requestBody = {
                                  + content  = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/OtpEmail"
                                            }
                                        }
                                    }
                                  + required = true
                                }
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "OTP email successfully sent with referenceId: {Id}"
                                    }
                                  + "400" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "NotifyException error message"
                                    }
                                  + "403" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "User has not been authorized"
                                    }
                                }
                              + summary     = "Send email containing B2C one-time password"
                              + tags        = [
                                  + "Publication Services notification API",
                                ]
                            }
                        }
                    }
                  + servers      = [
                      + {
                          + description = "Generated server url"
                          + url         = "https://pip-publication-services.staging.platform.hmcts.net"
                        },
                    ]
                }
            )
        }
    }

  # module.apim_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pip-publication-services-api"
      + id                  = (known after apply)
      + product_id          = "pip-product-stg"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.apim_api_policy[0].azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pip-publication-services-api"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":385,"Program":"tfcmt","SHA1":"","Vars":{}} -->